namespace ArkanParking.BL.Services;
// TODO: створи клас ParkingService, що реалізує інтерфейс IParkingService.
// Якщо спробувати додати транспортний засіб на заповнену парковку, повинно бути викинуто InvalidOperationException.
// Якщо спробувати видалити транспортний засіб із негативним балансом (боргом), також повинно бути викинуто InvalidOperationException.
// Інші правила валідації та формат конструктора вказані в тестах.
// Інші деталі реалізації залишаються на твій розсуд, але вони повинні відповідати вимогам інтерфейсу 
// та тестам. Наприклад, у ParkingServiceTests можна знайти необхідний формат конструктора та правила валідації.
